Show / Hide Table of Contents
Class BeamLoadsImportMappingData
BeamLoadsImportMappingData
Inheritance
System.Object
BeamLoadsImportMappingData
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[Serializable]
public class BeamLoadsImportMappingData
Constructors
Improve this Doc   View Source
BeamLoadsImportMappingData()
Constructor
Declaration
public BeamLoadsImportMappingData()
Properties
Improve this Doc   View Source
BeamID
BeamID
Declaration
[DataMember]
public int BeamID { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
CADBeamID
CADBeamID
Declaration
[DataMember]
public int CADBeamID { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
CoeffVM_X
CoeffVM_X
Declaration
[DataMember]
public double CoeffVM_X { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
CoeffVM_Y
CoeffVM_Y
Declaration
[DataMember]
public double CoeffVM_Y { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
CoeffVM_Z
CoeffVM_Z
Declaration
[DataMember]
public double CoeffVM_Z { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source